[
    {
        "title": "Pornography case: ED raids premises linked to Shilpa Shetty's husband Raj Kundra in Mumbai, UP",
        "link": "https://indianexpress.com/article/cities/mumbai/ed-raids-raj-kundra-pornography-case-9696874/?ref=hometop_hp",
        "content": "The Enforcement Directorate (ED) is conducting raids at 15 premises, including that of businessman and Bollywood actor Shilpa Shetty’s husband Raj Kundra, besides various other places in Mumbai and Uttar Pradesh in connection with the pornography case against Kundra.\nSources in the agency said the places being searched include Kundra’s residence in Juhu and premises linked to hisassociates.\nIn May 2022, the central agency registered a money laundering case against Raj Kundra in connection with the pornography case. The case was registered based on an FIR against him by the Mumbai police in 2021 for allegedly running a pornography racket. Kundra had been arrested by the Mumbai police in this connection. The ED is probing the financial transactions pertaining to the case.\nADVERTISEMENT\nThe police made the first arrests in the alleged porn racket case in February 2021. Prior to this, the Mumbai Police Crime Branch conducted raids at a bungalow in Madh Island where porn movies were allegedly being shot.\nKundra was arrested in July 2021 after investigations revealed that he was a key conspirator in the case. The pornographic content produced was being distributed over subscription-based mobile apps like HotHit Movies and Hotshots.\nThe Hotshots app was developed by Armsprime Media Private Limited, a firm founded by Kundra in 2019. Armsprime later sold Hotshots to Kenrin Limited, a UK-based firm owned by Kundra’s brother-in-law Pradeep Bakshi.\nThe Mumbai police have already filed a chargesheet against Kundra and three other accused linked to the case. In 2021, Kundra spent two months in Mumbai’s Arthur Road jail and was granted bail in September that year.\nADVERTISEMENT\nThe ED is looking into significant overseas transactions in this connection. The agency is already investigating a money laundering case against Kundra over a Bitcoin scheme.\nIn April this year, the agency provisionally attached immovable and movable properties worth Rs 97.79 crore belonging to Kundra, under the Prevention of Money Laundering Act (PMLA) in the Bitcoin investment fraud case.\nThe central agency said the attached properties include a residential flat in Mumbai’s upscale Juhu area, which is currently in the name of Shilpa Shetty, a residential bungalow situated in Pune, and equity shares in Kundra’s name.\nThe ED filed the Bitcoin money laundering case against Kundra based on multiple FIRs registered by the police forces in Maharashtra and Delhi against Variable Tech Pvt Ltd, Amit Bhardwaj (deceased), Ajay Bhardwaj, Vivek Bhardwaj, Simpy Bhardwaj, Mahender Bhardwaj, and several multiple-level marketing (MLM) agents.\nADVERTISEMENT\nThe FIRs alleged the accused had collected huge funds in the form of Bitcoins – reportedly worth Rs 6,600 crore in 2017 — from people with false promises of a 10 per cent monthly return in the form of Bitcoins. “The collected Bitcoins were supposed to be utilised for Bitcoin mining and investors were supposed to get huge returns in crypto assets. But the promoters cheated the investors and have been concealing the ill-gotten Bitcoins in obscure online wallets,” the ED had stated.\nIn November 2023, Kundra made a movie ‘Undertrial 69 aka UT 69′ based on his days in prison, playing the central role himself."
    },
    {
        "title": "How Ghaziabad woman was reunited with kidnapped son after 30 years",
        "link": "https://indianexpress.com/article/cities/delhi/when-he-called-me-mother-i-was-moved-to-tears-ghaziabad-woman-reunited-with-kidnapped-son-after-30-years-9696296/?ref=hometop_hp",
        "content": "When 58-year-old Leelavati received a message from Khoda police station in Ghaziabad on Tuesday, telling her they had found her son, she wasn’t too excited.\nOver the last 31 years, she has received over seven such calls from the police, only to return disappointed. Her son Bhim Singh was nine, she says, when he was kidnapped in broad daylight. “I thought it would be a repeat of what happened many times earlier,’’ she recalls. “The police will bring a man in front of me and ask me to identify if he is my son. Every time they called me, I told them (policemen) about the marks on my son’s body. The marks never matched and I would return disappointed.”\nHowever, a small spark of hope remained. “I hardly had any hope of reuniting with my missing son… but then I kept telling myself, ‘what if they had found him?,’’ she says. “I had to go.”\nADVERTISEMENT\nInside Khoda police station, Leelavati covered her head with her blue saree as soon as a man appeared. “He looked at me and shouted… this is my mother,’’ she recalls.\n“I was a bit surprised and didn’t believe him. But when he called me mother again, I was moved to tears,’’ she says. There was another surprise for her though. She gave the policemen details of the marks on her missing son’s body and when they checked, her description matched. “He was indeed my son”.\nBhim is now a grown man. He is 40.\nThe tragic tale of this family, staying in a single-room house on the terrace of a two-storeyed building in Gali no. 6 of Ghaziabad’s Shaheed Nagar, began on September 8, 1993. Bhim, then around 9 years old, was returning from DBS Public school along with his two older sisters, Rajo and Santosh.\nBhim remembers that day vividly. “I remember asking my sister, Rajo, to buy me an umbrella while we were on our way back home. She didn’t want to and we were arguing,’’ he recalls. “Suddenly, a few men encircled me. They picked me up, pushed me into an auto (rickshaw) and drove away”.\nADVERTISEMENT\nFor Santosh (45) and Rajo (43), that moment is etched in their memory. “He was wearing a white shirt and light blue trousers. We were minutes away from our home, when a group of unknown men took him away,” recalls Santosh.\nAt that time, Rajo and Santosh were 14 and 12 years old respectively. Bhim also had a younger sister, Hema, who was less than a year old at the time. The sisters say they ran back to their home and informed their mother.\n“Their eyes were red. They were shivering and all they said was some people had taken Bhim in an auto. I ran barefoot to the spot. Their father was not home. I kept looking for him the entire day,” recalls Leelavati. “It was an unending trauma… we kept looking for him.”\nAfter 31 years, two months and 19 days, the family was miraculously reunited.\nADVERTISEMENT\n“The last time I went to the police station three years ago. That time too my son wasn’t there. But I never lost hope. I knew he would find us one day,” says Leelavati\nWhile Bhim was missing, a lot changed — both his grandparents died, two of his sister got married. “My in-laws had left to go back to their village, Baidpura in Dadri, a year after he was kidnapped. His grandfather died 10 years ago and three years later his grandmother also died,” says Leelavati. “Two of his sisters are already married. We have become old now.”\nIt was Bhim’s younger sister Hema who saw a picture resembling her elder brother in a local daily on September 22. “It was an article about a man who had been missing for a long time and the police were searching for his family to reunite them,’’ Hema says. A relative, who works as a constable in the Ghaziabad Police, asked the family to visit the police station.\nAt Khoda police station –Bhim had already been taken to six different police stations before this — he also recognised his sisters the moment he saw them.\nADVERTISEMENT\n“Besides, he had a mole on his right leg, a mark on left ear, a cut mark on his forehead and his hollow shaped head,” Leelavati says.\nBhim’s father, 70-year-old Tularam, however, wants to convince himself further. “We know he is our son. But we will get the DNA test done after December 6 to be sure about it,” he says.\nThe Ghaziabad police had been approaching the family because Bhim’s father had filed a missing person complaint at Mohan Nagar police station on September 9, 1993, a day after the boy was kidnapped. This case was unresolved.\nTwo days after Bhim was kidnapped, the family says, they had received a ransom letter. “We got a letter and his kidnappers demanded Rs 8 lakhs to set him free,” Tula Ram says.\nADVERTISEMENT\nWhile the family was frantically looking for him, Bhim says his nightmare began the moment he was kidnapped. “After taking me away in the auto, the kidnappers subsequently put me in a truck and drove away,’’ he says. The kidnappers, he says, had taken him to Jaisalmer in Rajasthan. “Before I could do anything, they chained me outside a hut of a herder,’’ he recalls. “They would make me rear sheep and cows…. milk them… during the day but they would keep me chained at night so that I couldn’t run away”.\nWhen asked if he ever made any attempts to run away, Bhim says he couldn’t.\n“I did not know where to go. For 30 to 40 km around the place, I knew there was no road. People travelled in camel carts. How far could I go on foot?” he says.\nBhim says that his “owner” was a man named Sai Ram who “kept an eye on me all the time”.\nADVERTISEMENT\n“Once, a sheep had become so weak that it was not able to stand and died. They beat me badly.. they broke my right hand. My jaw got dislocated, I was scared of them,” he says.\nHow did he escape?\n“A few days ago, I met a truck driver while I was grazing sheep in the afternoon in Jaisalmer,” he says. “I narrated my entire story to him. He rescued me. He wrote all the information that I remembered on a piece of paper. This finally helped me reach Ghaziabad,’’ Bhim recalls. This note mentioned his name, his father’s name and that he is from somewhere in Ghaziabad.\n“The driver dropped me off at a market somewhere in Delhi. From there, with the help of people, I reached Indirapuram Police station in Ghaziabad,” Bhim says.\nHe says that initially he cried a lot. “But now my tears have dried up. I can’t cry anymore.”\nADVERTISEMENT\nHe says that he always missed his sisters while living in that desert far away. ”We would always play together in the house. I used to hate the fact that Happo would always get more milk to drink,” he smiles.\nBhim had given his own nickname, Happo, to his younger sister Hema – then just a newly born.\nThe sisters say while Bhim was missing, every Raksha Bandhan they would tie a Rakhi to his photo, which was clicked when Bhim was 6 years old.\nBhim, the Ghaziabad Police says, was rescued by a truck driver. “He found him somewhere in Jaisalmer. Bhim narrated the entire incident to the truck driver. This truck driver wrote his information on a paper and helped him reach the police,” Deputy Commissioner of Police, Ghaziabad, Nimish Patil says.\nADVERTISEMENT\nBhim had reached Ghaziabad on November 22. For the next five days, he was taken to several police stations where families of missing children came to check. He had met three other families earlier but had categorically said they are not his family.\n“It is a miracle,’’ Bhim’s father Tularam says. “We are going to teach him to use a mobile phone first and ask him to continue his education. He was in class three then, now he will start studying again.”"
    },
    {
        "title": "Opinion: Maharashtra is set to be a BJP party-society",
        "link": "https://indianexpress.com/article/opinion/columns/maharashtra-is-set-to-be-a-bjp-party-society-9696166/?ref=hometop_hp",
        "content": "The historic nature of Maharashtra’s Assembly results might be more visible if we set aside the dramatic numbers and surprising turn-around from the Lok Sabha outcome. No doubt, the numbers are daunting — winning 132 seats out of the less than 150 contested, or pushing the rivals 14 percentage points backward, are no mean feats. But let us look at the major shifts this result will bring about.\nIf one starts tracing the history of how Congress lost control over states, Maharashtra will be one of the last ones. Andhra Pradesh and Karnataka came out of Congress dominance in the early 1980s. At that time, Congress in Maharashtra was still in the saddle, though the dominance had almost become dilapidated by then. The party went on to win 1985 handsomely and 1990 with hiccups. In a sense, this state was “the last fortress of Congress dominance” (to borrow the title of a book by Palshikar and Rajeshwari Deshpande, 2020).\nSubscribe to read on\nSelect your plan\nBEST VALUE\nAll-Access\nAd-lite experience\nAccess to premium stories\nAccess to ePaper\nSubscribe for ₹3.5/day\nDigital Only\nAd-lite experience\nAccess to premium stories\nAccess to ePaper\nSubscribe for ₹2.5/day\nAlready a subscriber? Sign in"
    },
    {
        "title": "Shubhra Gupta writes: Neeraj Pandey’s Sikandar Ka Muqaddar is a rare beast in Bollywood",
        "link": "https://indianexpress.com/article/entertainment/movie-review/sikandar-ka-muqaddar-movie-review-neeraj-pandey-netflix-tamannaah-bhatia-avinash-tiwary-jimmy-shergill-9696635/?ref=hometop_hp",
        "content": "A large jewellery exhibition in Mumbai becomes the site of a heist. A hysterical phone call raises alarm, gunfire is heard, the cops on duty herd the panicked gathering into a secluded area, and during the melee, a fistful of precious gems go missing.\nChief investigator Jaswinder Singh (Jimmy Shergill) zeroes in on three suspects. Long-time employee at a jewellery store Mangesh Desai (Mehta), his pretty colleague Kamini (Tamannaah Bhatia), and computer techie Sikandar Sharma (Avinash Tiwary) who is in a tearing hurry to leave the grounds once the all-clear is sounded. The more Jaswinder hounds them, the more they stick to their stand of having nothing to do with the robbery. Do they protest too much? Or are they truly innocent, proving Jaswinder with his vaunted ‘instinct’ wrong, marring his blameless record for catching every single thief he has encountered?\nAlso read – Crew movie review: Kareena Kapoor, Tabu, Kriti Sanon’s easy-breezy comedy washes away stench of recent Bollywood duds\nADVERTISEMENT\nNeeraj Pandey has pulled off quite a heist with his new film in which he shares writing credits with Vipul K Rawal. The ‘heeron ki chori’ is just a lead-in to a film which is more pulpy character study than out-and-out thriller, a rare beast in Bollywood. The two-hour plus duration is dotted with twists and turns you don’t see coming, even as the whodunit-howdunit suspense keeps simmering: there are things I did twig on to, but the surprises kept coming, making things enjoyable.\nThat said, there are contrivances and plot-holes aplenty, and a few characters aren’t developed as much as they should have, but given the genre, you are willing to take them in your stride. Because the moment you are ripe for an eye-roll, something unexpected happens, and your attention is diverted, which is exactly what the filmmakers want.\nThe film swings through a fifteen year arc, from 2009 when the heist occurred, to the present when the mystery is sought to be unravelled through a series of flashbacks. How an event such as this can impact lives, and take them into unanticipated directions is woven through the telling, and the characters look and feel older, just as they should, even though some of the make-up looks plastered on.\nThe ensemble is the key to keep us watching. Jaswinder’s career has taken a dive, but his obsessive beliefs remain unshaken, a trait that has seen him part ways with his partner (Dutta, in a small role, leaves a big impact), and Shergill plays his character with the right degree of worn conviction. Tamannaah Bhatia proves that she doesn’t need only dance numbers in horror comedies to get eyeballs: she can be ‘stree’ enough. For a change, Rajeev Mehta gets more than just a forgettable role on the side. And Avinash Tiwary, flying high on his successful re-release of ‘Laila Majnu’, is, as ever, a delight.\nADVERTISEMENT\nRead more – Chor Nikal Ke Bhaaga movie review: There’s a lot going on in Yami Gautam, Sunny Kaushal film\nBeing on OTT means you can junk big stars in the pursuit of good story-telling. Or that’s what it was supposed to mean, before the streamers also got sucked into vacuous starry propositions with zero results. ‘Sikandar Ka Muqadaar’, its title riffing off on one of Amitabh Bachchan’s late 70s blockbusters, is a solid example of how you can get a film going on the strength of plot and performance, with stars servicing the story, just the way it should be.\nSikandar Ka Muqaddar\nDirector – Neeraj Pandey\nCast – Avinash Tiwary, Jimmy Shergill, Tamannaah Bhatia, Rajeev Mehta, Ridhima Pandit, Divya Dutta, Ashrut Jain\nRating – 3/5"
    }
]